{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "softmax"}}], "build_input_shape": [null, 256, 256, 3]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of111.bin", "group1-shard2of111.bin", "group1-shard3of111.bin", "group1-shard4of111.bin", "group1-shard5of111.bin", "group1-shard6of111.bin", "group1-shard7of111.bin", "group1-shard8of111.bin", "group1-shard9of111.bin", "group1-shard10of111.bin", "group1-shard11of111.bin", "group1-shard12of111.bin", "group1-shard13of111.bin", "group1-shard14of111.bin", "group1-shard15of111.bin", "group1-shard16of111.bin", "group1-shard17of111.bin", "group1-shard18of111.bin", "group1-shard19of111.bin", "group1-shard20of111.bin", "group1-shard21of111.bin", "group1-shard22of111.bin", "group1-shard23of111.bin", "group1-shard24of111.bin", "group1-shard25of111.bin", "group1-shard26of111.bin", "group1-shard27of111.bin", "group1-shard28of111.bin", "group1-shard29of111.bin", "group1-shard30of111.bin", "group1-shard31of111.bin", "group1-shard32of111.bin", "group1-shard33of111.bin", "group1-shard34of111.bin", "group1-shard35of111.bin", "group1-shard36of111.bin", "group1-shard37of111.bin", "group1-shard38of111.bin", "group1-shard39of111.bin", "group1-shard40of111.bin", "group1-shard41of111.bin", "group1-shard42of111.bin", "group1-shard43of111.bin", "group1-shard44of111.bin", "group1-shard45of111.bin", "group1-shard46of111.bin", "group1-shard47of111.bin", "group1-shard48of111.bin", "group1-shard49of111.bin", "group1-shard50of111.bin", "group1-shard51of111.bin", "group1-shard52of111.bin", "group1-shard53of111.bin", "group1-shard54of111.bin", "group1-shard55of111.bin", "group1-shard56of111.bin", "group1-shard57of111.bin", "group1-shard58of111.bin", "group1-shard59of111.bin", "group1-shard60of111.bin", "group1-shard61of111.bin", "group1-shard62of111.bin", "group1-shard63of111.bin", "group1-shard64of111.bin", "group1-shard65of111.bin", "group1-shard66of111.bin", "group1-shard67of111.bin", "group1-shard68of111.bin", "group1-shard69of111.bin", "group1-shard70of111.bin", "group1-shard71of111.bin", "group1-shard72of111.bin", "group1-shard73of111.bin", "group1-shard74of111.bin", "group1-shard75of111.bin", "group1-shard76of111.bin", "group1-shard77of111.bin", "group1-shard78of111.bin", "group1-shard79of111.bin", "group1-shard80of111.bin", "group1-shard81of111.bin", "group1-shard82of111.bin", "group1-shard83of111.bin", "group1-shard84of111.bin", "group1-shard85of111.bin", "group1-shard86of111.bin", "group1-shard87of111.bin", "group1-shard88of111.bin", "group1-shard89of111.bin", "group1-shard90of111.bin", "group1-shard91of111.bin", "group1-shard92of111.bin", "group1-shard93of111.bin", "group1-shard94of111.bin", "group1-shard95of111.bin", "group1-shard96of111.bin", "group1-shard97of111.bin", "group1-shard98of111.bin", "group1-shard99of111.bin", "group1-shard100of111.bin", "group1-shard101of111.bin", "group1-shard102of111.bin", "group1-shard103of111.bin", "group1-shard104of111.bin", "group1-shard105of111.bin", "group1-shard106of111.bin", "group1-shard107of111.bin", "group1-shard108of111.bin", "group1-shard109of111.bin", "group1-shard110of111.bin", "group1-shard111of111.bin"], "weights": [{"name": "sequential/batch_normalization/gamma", "shape": [32], "dtype": "float32"}, {"name": "sequential/batch_normalization/beta", "shape": [32], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/gamma", "shape": [1024], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/beta", "shape": [1024], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "sequential/conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "sequential/conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "sequential/conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "sequential/conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [112896, 1024], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [1024], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [1024, 10], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [10], "dtype": "float32"}]}]}